Autodesk.Revit.DB.Electrical.CableTraySettings.GetCableTraySettings(Autodesk.Revit.DB.Document)
Gets the cable tray settings of the project.
document:
The document.
Returns:
The cable tray settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.ConnectorSeparator
The cable tray connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSuffix
The cable tray size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSeparator
The cable tray size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017